In [1]:
import pandas as pd

# Arithmetic between Pandas Objects / Data Alignment

In [2]:
topfive_2004 = pd.read_csv("topfive_2004.csv", index_col="Athlete")

In [4]:
topfive_2008 = pd.read_csv("topfive_2008.csv", index_col="Athlete")

In [5]:
topfive_2004

                  Gold  Silver  Bronze
Athlete
PHELPS, Michael    6.0     0.0     2.0
PEIRSOL, Aaron     3.0     0.0     0.0
THORPE, Ian        2.0     1.0     1.0
KITAJIMA, Kosuke   2.0     0.0     1.0
HACKETT, Grant     1.0     2.0     0.0

 We have bronze column with lower case b

In [6]:
topfive_2008

                  Gold  Silver  bronze
Athlete
PHELPS, Michael    8.0     0.0     0.0
GREVERS, Matt      2.0     1.0     0.0
PEIRSOL, Aaron     2.0     1.0     0.0
LOCHTE, Ryan       2.0     0.0     2.0
KITAJIMA, Kosuke   2.0     0.0     1.0

# We can add 2 dataframes together, wirh add method
## Parameters:
### fill_value: fill missing values with this value
### axis: 0 for rows, 1 for columns

In [13]:
topfive_2004.add(topfive_2008, fill_value=0, axis=0)

                  Bronze  Gold  Silver  bronze
Athlete
GREVERS, Matt        NaN   2.0     1.0     0.0
HACKETT, Grant       0.0   1.0     2.0     NaN
KITAJIMA, Kosuke     1.0   4.0     0.0     1.0
LOCHTE, Ryan         NaN   2.0     0.0     2.0
PEIRSOL, Aaron       0.0   5.0     1.0     0.0
PHELPS, Michael      2.0  14.0     0.0     0.0
THORPE, Ian          1.0   2.0     1.0     NaN

We have NaN values in the result, because we have missing values in both dataframes(bronze column and Bronze column)

# We can subtract 2 dataframes together, with sub method.
sub method is similar to add method.

In [14]:
topfive_2004.sub(topfive_2008, fill_value=0, axis=0)

                  Bronze  Gold  Silver  bronze
Athlete
GREVERS, Matt        NaN  -2.0    -1.0     0.0
HACKETT, Grant       0.0   1.0     2.0     NaN
KITAJIMA, Kosuke     1.0   0.0     0.0    -1.0
LOCHTE, Ryan         NaN  -2.0     0.0    -2.0
PEIRSOL, Aaron       0.0   1.0    -1.0     0.0
PHELPS, Michael      2.0  -2.0     0.0     0.0
THORPE, Ian          1.0   2.0     1.0     NaN